### live

<details><summary>Show Plan - no change</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra-data relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/dphoto/dphoto/deployments/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/dphoto/dphoto/deployments

To view this run in a browser, visit:
https://app.terraform.io/app/dphoto/dphoto-live/runs/run-HdxdYuQo8Rog6WT6

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
aws_ssm_parameter.catalog_table_name: Refreshing state... [id=/dphoto/live/dynamodb/catalog/tableName]
aws_s3_bucket.storage: Refreshing state... [id=dphoto-live-storage]
aws_kms_key.storage[0]: Refreshing state... [id=64ce2c68-36b4-49cf-8f4e-4e78ec71a41c]
aws_s3_bucket.cache: Refreshing state... [id=dphoto-live-cache]
aws_iam_user.cli: Refreshing state... [id=dphoto-live-cli]
aws_sqs_queue.async_archive_caching_jobs: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-live-async-archive-caching-jobs.fifo]
aws_sns_topic.archive: Refreshing state... [id=arn:aws:sns:eu-west-1:472045025110:dphoto-live-archive-jobs]
data.aws_iam_policy_document.index_rw: Reading...
data.aws_iam_policy_document.index_rw: Read complete after 0s [id=1595237765]
aws_iam_policy.index_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-index-rw]
aws_iam_access_key.rolling_cli["2022-12"]: Refreshing state... [id=AKIAW32ATO5LEM4353GJ]
aws_iam_access_key.rolling_cli["2024-04"]: Refreshing state... [id=AKIAW32ATO5LKFSZUTV2]
aws_iam_user_policy_attachment.cli_table: Refreshing state... [id=dphoto-live-cli-20210527210154843500000002]
aws_ssm_parameter.iam_policy_dyn_table_rw: Refreshing state... [id=/dphoto/live/iam/policies/indexRWArn]
aws_ssm_parameter.sqs_archive_arn: Refreshing state... [id=/dphoto/live/sqs/archive/arn]
aws_iam_policy.archive_sqs_send: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto-live-archive-sqs-send]
aws_ssm_parameter.sqs_archive_url: Refreshing state... [id=/dphoto/live/sqs/archive/url]
aws_ssm_parameter.sns_archive_arn: Refreshing state... [id=/dphoto/live/sns/archive/arn]
data.aws_iam_policy_document.archive_sns_publish: Reading...
data.aws_iam_policy_document.archive_sns_publish: Read complete after 0s [id=393849065]
aws_iam_policy.archive_sns_publish: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto-live-archive-sns-publish]
aws_sqs_queue_policy.async_archive_caching_jobs: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-live-async-archive-caching-jobs.fifo]
aws_ssm_parameter.iam_policy_archive_sqs_send: Refreshing state... [id=/dphoto/live/iam/policies/archive_sqs_send/arn]
aws_iam_user_policy_attachment.archive_sqs_send: Refreshing state... [id=dphoto-live-cli-20220728232010840800000003]
aws_ssm_parameter.iam_policy_archive_sns_publish: Refreshing state... [id=/dphoto/live/iam/policies/archive_sns_publish/arn]
aws_iam_user_policy_attachment.archive_sns_publish: Refreshing state... [id=dphoto-live-cli-20220728231945971600000001]
aws_s3_bucket_server_side_encryption_configuration.storage["arn:aws:kms:eu-west-1:472045025110:key/64ce2c68-36b4-49cf-8f4e-4e78ec71a41c"]: Refreshing state... [id=dphoto-live-storage]
aws_s3_bucket_acl.storage: Refreshing state... [id=dphoto-live-storage,private]
data.aws_iam_policy_document.storage_rw: Reading...
aws_s3_bucket_lifecycle_configuration.storage: Refreshing state... [id=dphoto-live-storage]
aws_s3_bucket_versioning.storage: Refreshing state... [id=dphoto-live-storage]
aws_ssm_parameter.storage_bucket_name: Refreshing state... [id=/dphoto/live/s3/storage/bucketName]
data.aws_iam_policy_document.storage_ro: Reading...
aws_s3_bucket_public_access_block.s3_storage_block_public_access: Refreshing state... [id=dphoto-live-storage]
aws_s3_bucket_ownership_controls.storage: Refreshing state... [id=dphoto-live-storage]
data.aws_iam_policy_document.storage_rw: Read complete after 0s [id=2008889015]
aws_iam_policy.storage_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-storage-rw]
data.aws_iam_policy_document.storage_ro: Read complete after 0s [id=2651647098]
aws_s3_bucket_versioning.cache: Refreshing state... [id=dphoto-live-cache]
aws_s3_bucket_server_side_encryption_configuration.cache["arn:aws:kms:eu-west-1:472045025110:key/64ce2c68-36b4-49cf-8f4e-4e78ec71a41c"]: Refreshing state... [id=dphoto-live-cache]
data.aws_iam_policy_document.cache_rw: Reading...
data.aws_iam_policy_document.cache_rw: Read complete after 0s [id=129955124]
aws_s3_bucket_public_access_block.s3_cache_block_public_access: Refreshing state... [id=dphoto-live-cache]
aws_ssm_parameter.cache_bucket_name: Refreshing state... [id=/dphoto/live/s3/cache/bucketName]
aws_s3_bucket_lifecycle_configuration.cache_expiration: Refreshing state... [id=dphoto-live-cache]
aws_s3_bucket_acl.cache: Refreshing state... [id=dphoto-live-cache,private]
aws_s3_bucket_ownership_controls.cache: Refreshing state... [id=dphoto-live-cache]
aws_iam_policy.storage_ro: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-storage-ro]
aws_iam_user_policy_attachment.cli_bucket: Refreshing state... [id=dphoto-live-cli-20210527210154836100000001]
aws_iam_policy.cache_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-cache-rw]
aws_iam_user_policy_attachment.cli_cache: Refreshing state... [id=dphoto-live-cli-20220728231947722900000002]
aws_ssm_parameter.iam_policy_bucket_ro: Refreshing state... [id=/dphoto/live/iam/policies/storageROArn]
aws_ssm_parameter.iam_policy_cache_rw: Refreshing state... [id=/dphoto/live/iam/policies/cacheRWArn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.archive_relocate will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "archive_relocate" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.archive_sqs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "archive_sqs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-west-1:472045025110:dphoto-live-async-archive-caching-jobs.fifo",
            ]
          + sid       = "Allow SNS to publish messages"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:eu-west-1:472045025110:dphoto-live-archive-jobs",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.archive_sqs_send will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "archive_sqs_send" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-west-1:472045025110:dphoto-live-async-archive-caching-jobs.fifo",
            ]
        }
    }

  # aws_iam_policy.archive_relocate will be created
  + resource "aws_iam_policy" "archive_relocate" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "dphoto-live-archive-relocate-sqs-send"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all  = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
    }

  # aws_iam_policy.archive_sqs_send will be updated in-place
  ~ resource "aws_iam_policy" "archive_sqs_send" {
        id        = "arn:aws:iam::472045025110:policy/dphoto-live-archive-sqs-send"
        name      = "dphoto-live-archive-sqs-send"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sqs:SendMessage"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-west-1:472045025110:dphoto-live-async-archive-caching-jobs.fifo"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Application" = "dphoto-data"
            "CreatedBy"   = "terraform"
            "Environment" = "live"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_sqs_queue.archive_relocate will be created
  + resource "aws_sqs_queue" "archive_relocate" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "dphoto-live-archive-relocate"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 5400
    }

  # aws_sqs_queue.async_archive_caching_jobs will be updated in-place
  ~ resource "aws_sqs_queue" "async_archive_caching_jobs" {
        id                                = "https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-live-async-archive-caching-jobs.fifo"
        name                              = "dphoto-live-async-archive-caching-jobs.fifo"
        tags                              = {
            "Application" = "dphoto-data"
            "CreatedBy"   = "terraform"
            "Environment" = "live"
        }
      ~ visibility_timeout_seconds        = 900 -> 5400
        # (14 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.async_archive_caching_jobs will be updated in-place
  ~ resource "aws_sqs_queue_policy" "async_archive_caching_jobs" {
        id        = "https://sqs.eu-west-1.amazonaws.com/472045025110/dphoto-live-async-archive-caching-jobs.fifo"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:eu-west-1:472045025110:dphoto-live-archive-jobs"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:eu-west-1:472045025110:dphoto-live-async-archive-caching-jobs.fifo"
                      - Sid       = "Allow SNS to publish messages"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_ssm_parameter.iam_policy_archive_relocate will be created
  + resource "aws_ssm_parameter" "iam_policy_archive_relocate" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/iam/policies/archive_relocate_send/arn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.iam_policy_bucket_rw will be created
  + resource "aws_ssm_parameter" "iam_policy_bucket_rw" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/iam/policies/storageRWArn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs_archive_relocate_arn will be created
  + resource "aws_ssm_parameter" "sqs_archive_relocate_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/sqs/archive_relocate/arn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs_archive_relocate_url will be created
  + resource "aws_ssm_parameter" "sqs_archive_relocate_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/sqs/archive_relocate/url"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 6 to add, 3 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 11 estimated
           $1.00000000000000128/mo +$0.0

```

</details>

*Action: `pull_request`*